CSI API ETABS v1

# cDStItalianNTC2018SGetOverwrite Method

---

Retrieves the value of a steel design overwrite item

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetOverwrite(
    	string Name,
    	int Item,
    	ref string textValue,
    	ref double numericValue,
    	ref bool ProgDet
    )

    Function GetOverwrite (
    	Name As String,
    	Item As Integer,
    	ByRef textValue As String,
    	ByRef numericValue As Double,
    	ByRef ProgDet As Boolean
    ) As Integer

    Dim instance As cDStItalianNTC2018S
    Dim Name As String
    Dim Item As Integer
    Dim textValue As String
    Dim numericValue As Double
    Dim ProgDet As Boolean
    Dim returnValue As Integer

    returnValue = instance.GetOverwrite(Name,
    	Item, textValue, numericValue, ProgDet)

    int GetOverwrite(
    	String^ Name,
    	int Item,
    	String^% textValue,
    	double% numericValue,
    	bool% ProgDet
    )

    abstract GetOverwrite :
            Name : string *
            Item : int *
            textValue : string byref *
            numericValue : float byref *
            ProgDet : bool byref -> int

#### Parameters

Name

    Type: SystemString
The name of a frame object with a steel frame design procedure

Item

    Type: SystemInt32
This is an integer between 1 and 58, inclusive, indicating the overwrite item
considered.

  1. Design Section
  2. Framing Type
  3. Section Class
  4. Column buckling curve (y-y)
  5. Column buckling curve (z-z)
  6. Buckling curve for LTB
  7. System Overstrength
  8. Is Shape Rolled
  9. Consider Deflection
  10. Deflection check type
  11. DL deflection limit, L/Value
  12. SDL + LL deflection limits, L/Value
  13. LL deflection limit, L/Value
  14. Total load deflection limit, L/Value
  15. Total camber limit, L/Value
  16. DL deflection limit, absolute
  17. SDL + LL deflection limit, absolute
  18. LL deflection limit, absolute
  19. Total load deflection limit, absolute
  20. Total camber limit, absolute
  21. Specified camber
  22. Net area to total area ratio
  23. Live load reduction factor
  24. Unbraced length ratio, Ly
  25. Unbraced length ratio, Lz
  26. Unbraced length ratio, LLTB
  27. Effective length factor, K1y
  28. Effective length factor, K1z
  29. Effective length factor, K2y
  30. Effective length factor, K2z
  31. Effective length factor, KLTB
  32. Bending coefficient, C1
  33. Moment coefficient, kyy
  34. Moment coefficient, kzz
  35. Moment coefficient, kzy
  36. Moment coefficient, kyz
  37. Yield stress, Fy
  38. Material Overstrength, GammaOv
  39. Compressive capacity, Nc,Rd
  40. Tensile capacity Nt,Rd
  41. Bending capacity Y-Y, Mcy,Rd
  42. Bending capacity Z-Z, Mcz,Rd
  43. Buckling resistance moment, Mb,Rd
  44. Shear capacity Z-Z, Vz,Rd
  45. Shear capacity Y-Y, Vy,Rd
  46. Demand/capacity ratio limit

  49. Bending coefficient, C2
  50. Bending coefficient, C3
  51. Warping constant, Iw
  52. Elastic torsional buckling force, Ncr,T
  53. Elastic torsional-flexural buckling force, Ncr,TF
  54. Elastic critical moment for lateral-torsional buckling, Mcr
  55. Warping coefficient, kw
  56. Coordinate of load application, za
  57. Coordinate of shear center, zs
  58. Bending Coefficients Psi, C2, C3 Option

textValue

    Type: SystemString
The string value of the considered overwrite item.

numericValue

    Type: SystemDouble
The numeric value of the considered overwrite item.

  1. Design Section
  2. Framing Type
     * 0 = Program Default
     * 1 = DCH-MRF
     * 2 = DCL-MRF
     * 3 = DCH-CBF
     * 4 = DCL-CBF
     * 5 = DCH-EBF
     * 6 = DCL-EBF
     * 7 = InvPendulum
     * 8 = Non Dissipative
  3. Section Class
     * 0 = Program Default
     * 1 = Class 1
     * 2 = Class 2
     * 3 = Class 3
     * 4 = Class 4
  4. Column buckling curve (y-y)
     * 0 = Program Default
     * 1 = a0
     * 2 = a
     * 3 = b
     * 4 = c
     * 5 = d
  5. Column buckling curve (z-z)
     * 0 = Program Default
     * 1 = a0
     * 2 = a
     * 3 = b
     * 4 = c
     * 5 = d
  6. Buckling curve for LTB
     * 0 = Program Default
     * 1 = a0
     * 2 = a
     * 3 = b
     * 4 = c
     * 5 = d
  7. System Overstrength

Value >= 0; 0 means use a program determined value.

  8. Is Shape Rolled
     * 0 = Program Default
     * 1 = No
     * 2 = Yes
  9. Consider Deflection
     * 0 = Program Default
     * 1 = No
     * 2 = Yes
  10. Deflection check type
     * 0 = Program Default
     * 1 = Ratio
     * 2 = Absolute
     * 3 = Both
  11. DL deflection limit, L/Value

Value >= 0; 0 means no check for this item.

  12. SDL + LL deflection limits, L/Value

Value >= 0; 0 means no check for this item.

  13. Value >= 0; 0 means no check for this item.

LL deflection limit, L/Value

  14. Total load deflection limit, L/Value

Value >= 0; 0 means no check for this item.

  15. Total camber limit, L/Value

Value >= 0; 0 means no check for this item.

  16. DL deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  17. SDL + LL deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  18. LL deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  19. Total load deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  20. Total camber limit, absolute

Value >= 0; 0 means no check for this item. [L]

  21. Specified camber

Value >= 0; 0 means no check for this item. [L]

  22. Net area to total area ratio

Value >= 0; 0 means use program determined value.

  23. Live load reduction factor

Value >= 0; 0 means use program determined value.

  24. Unbraced length ratio, Ly

Value >= 0; 0 means use program determined value.

  25. Unbraced length ratio, Lz

Value >= 0; 0 means use program determined value.

  26. Unbraced length ratio, LLTB

Value >= 0; 0 means use program determined value.

  27. Effective length factor, K1y

Value >= 0; 0 means use program determined value.

  28. Effective length factor, K1z

Value >= 0; 0 means use program determined value.

  29. Effective length factor, K2y

Value >= 0; 0 means use program determined value.

  30. Effective length factor, K2z

Value >= 0; 0 means use program determined value.

  31. Effective length factor, KLTB

Value >= 0; 0 means use program determined value.

  32. Bending coefficient, C1

Value >= 0; 0 means use program determined value.

  33. Moment coefficient, kyy

Value >= 0; 0 means use program determined value.

  34. Moment coefficient, kzz

Value >= 0; 0 means use program determined value.

  35. Moment coefficient, kzy

Value >= 0; 0 means use program determined value.

  36. Moment coefficient, kyz

Value >= 0; 0 means use program determined value.

  37. Yield stress, Fy

Value >= 0; 0 means use program determined value. [F/L^2]

  38. Material Overstrength, GammaOv

Value >= 0; 0 means use program determined value.

  39. Compressive capacity, Nc,Rd

Value >= 0; 0 means use program determined value. [F]

  40. Tensile capacity, Nt,Rd

Value >= 0; 0 means use program determined value. [F]

  41. Bending capacity Y-Y, Mcy,Rd

Value >= 0; 0 means use program determined value. [F.L]

  42. Bending capacity Z-Z, Mcz,Rd

Value >= 0; 0 means use program determined value. [F.L]

  43. Buckling resistance moment, Mb,Rd

Value >= 0; 0 means use program determined value. [F.L]

  44. Shear capacity Z-Z, Vz,Rd

Value >= 0; 0 means use program determined value. [F]

  45. Shear capacity Y-Y, Vy,Rd

Value >= 0; 0 means use program determined value. [F]

  46. Demand/capacity ratio limit

Value >= 0; 0 means use program determined value.

  49. Bending coefficient, C2

Value >= 0; 0 means use program determined value.

  50. Bending coefficient, C3

Value >= 0; 0 means use program determined value.

  51. Warping constant, Iw

Value >= 0; 0 means use program determined value.

  52. Elastic torsional buckling force, Ncr,T

Value >= 0; 0 means use program determined value.

  53. Elastic torsional-flexural buckling force, Ncr,TF

Value >= 0; 0 means use program determined value.

  54. Elastic critical moment for lateral-torsional buckling, Mcr

Value >= 0; 0 means use program determined value.

  55. Warping coefficient, kw

Value >= 0; 0 means use program determined value.

  56. Coordinate of load application, za
  57. Coordinate of shear center, zs
  58. Bending Coefficients Psi, C2, C3 Option
     * 1 = Method 1 - EC3
     * 2 = Method 2 - General
     * 3 = Method 3 - User Defined

ProgDet

    Type: SystemBoolean
If this item is True, the specified value is program determined.

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise it returns a
nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim textValue As String
       Dim Value As Double
       Dim ProgDet As Boolean

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'set steel design code
       ret = SapModel.DesignSteel.SetCode("Italian NTC 2018")

    'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis

    'start steel design
       ret = SapModel.DesignSteel.StartDesign

    'get overwrite item
       ret = SapModel.DesignSteel.Italian_NTC_2018.GetOverwrite("8", 1, textValue, Value, ProgDet)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDStItalianNTC2018S Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com